Revit 2026 API

# RebarFreeFormAccessorSetCurves(IListCurveLoop) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarFreeFormValidationResult SetCurves(
	IList<CurveLoop> curves
)
```
```vb
Public Function SetCurves (
	curves As IList(Of CurveLoop)
) As RebarFreeFormValidationResult
```
```cpp
public:
RebarFreeFormValidationResult SetCurves(
	IList<CurveLoop^>^ curves
)
```
```fsharp
member SetCurves :
        curves : IList<CurveLoop> -> RebarFreeFormValidationResult
```

#### Parameters

curves IListCurveLoop

#### Return Value

RebarFreeFormValidationResult

#### Reference

RebarFreeFormAccessor Class

SetCurves Overload

Autodesk.Revit.DB.Structure Namespace